wendylabsinc/wendy-lite/sdkconfig.defaults.esp32p4
# Target: ESP32-P4 (e.g. DFRobot DFR1172 FireBeetle 2 ESP32-P4).
# The on-board ESP32-C6 provides Wi-Fi and Bluetooth via ESP-Hosted over SDIO;
# its slave firmware is pre-flashed at the factory.
CONFIG_IDF_TARGET="esp32p4"

# 16 MB SPI flash on this board.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# DFRobot DFR1172 ships with early-revision P4 silicon (v1.0). The default
# IDF build targets v3.1+, which is mutually incompatible - opt into the
# pre-v3 support path and require at least v1.0.
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_100=y

# Custom partition table with a comfortable 3 MB app region and most of the
# remaining flash given to the WASM guest slot.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.esp32p4.csv"

# --- PSRAM (32 MB HEX @ 200 MHz, integrated in the ESP32-P4R32) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# Anything smaller than this stays in internal SRAM (latency-sensitive),
# anything larger may land in PSRAM. 16 KiB matches Espressif's guidance.
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# Power PSRAM from on-chip LDO2 (default for this board variant).
CONFIG_ESP_LDO_CHAN_PSRAM_DOMAIN=2

# --- ESP-Hosted: Wi-Fi + Bluetooth via on-board C6 over SDIO ---
# Pin out matches the ESP32-P4-Function-EV-Board (DFR1172 is wired the same).
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_P4_DEV_BOARD_FUNC_BOARD=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# Bluetooth controller lives on the C6 - disable the (non-existent) native
# controller and route NimBLE's HCI through ESP-Hosted's VHCI transport.
CONFIG_BT_CONTROLLER_DISABLED=y
CONFIG_BT_NIMBLE_TRANSPORT_UART=n
CONFIG_ESP_HOSTED_ENABLE_BT_NIMBLE=y
CONFIG_ESP_HOSTED_NIMBLE_HCI_VHCI=y

# ESP-Hosted recommends 1 kHz tick rate for snappier SDIO scheduling.
CONFIG_FREERTOS_HZ=1000

# Wi-Fi remote buffer / aggregation knobs from Espressif's P4+C6 reference.
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32

# LWIP throughput tuning to match the Wi-Fi pipe.
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# --- WAMR runtime: fast interpreter (more code memory, ~2x speed) ---
# CONFIG_WAMR_INTERP_CLASSIC is not set
CONFIG_WAMR_INTERP_FAST=y
# Use the normal loader so we can load larger / less constrained modules.
# CONFIG_WAMR_INTERP_LOADER_MINI is not set
CONFIG_WAMR_INTERP_LOADER_NORMAL=y

# App USB / CDC stack is off by default; CDC's TinyUSB pull-in needs an
# explicit opt-in. (Cleaned up in a later commit via Kconfig depends.)
# CONFIG_WENDY_APP_USB is not set
# CONFIG_WENDY_USB_CDC_ENABLED is not set
